In [1]:
import pandas as pd

In [8]:
#Creating dataframe using pd.DataFrame
mydataset = {
    'cars': ["BMW", "Volvo", "Ford"],
    'passings': [3,7,3]
}
myvar = pd.DataFrame(mydataset)
print(myvar)

    cars  passings
0    BMW         3
1  Volvo         7
2   Ford         3

In [9]:
print(pd.__version__)

1.2.4

In [10]:
#Creating series using pd.Series
a = [1,7,2]
myvar = pd.Series(a)
print(myvar)

0    1
1    7
2    2
dtype: int64

In [11]:
print(myvar[1])

7

In [14]:
#Creating Series with customized index.
index = ["x", "y", "z"]
a = [1,7,2]
myvar = pd.Series(a, index=index)
print(myvar)

x    1
y    7
z    2
dtype: int64

In [16]:
#Creating series using dictionary
calories = {"day1": 420, "day2": 380, "day3": 390}
myvar = pd.Series(calories)
print(myvar)

day1    420
day2    380
day3    390
dtype: int64

In [19]:
#Creating dataframe using dictionary.
data = {
    "calories": [420, 380, 390],
    "duration": [50, 40, 45]
}
myvar = pd.DataFrame(data)
print(myvar)

   calories  duration
0       420        50
1       380        40
2       390        45

In [22]:
print(myvar.loc[0])

calories    420
duration     50
Name: 0, dtype: int64

In [25]:
print(myvar.loc[[0,1]])

   calories  duration
0       420        50
1       380        40

In [27]:
print("Day1: ")
print(myvar.loc[0])
print("Day2: ")
print(myvar.loc[1])
print("Day3: ")
print(myvar.loc[2])

Day1:
calories    420
duration     50
Name: 0, dtype: int64
Day2:
calories    380
duration     40
Name: 1, dtype: int64
Day3:
calories    390
duration     45
Name: 2, dtype: int64

In [33]:
df = pd.read_csv("Salaries.csv")
df

         rank discipline   phd  service     sex    salary
0        Prof          B  56.0       49    Male  186960.0
1        Prof          A  12.0        6    Male   93000.0
2        Prof          A  23.0       20    Male  110515.0
3        Prof          A  40.0       31    Male  131205.0
4        Prof          B  20.0       18    Male  104800.0
..        ...        ...   ...      ...     ...       ...
73       Prof          B  18.0       10  Female  105450.0
74  AssocProf          B  19.0        6  Female  104542.0
75       Prof          B  17.0       17  Female  124312.0
76       Prof          A  28.0       14  Female  109954.0
77       Prof          A  23.0       15  Female  109646.0

[78 rows x 6 columns]

In [36]:
df.head()

   rank discipline   phd  service   sex    salary
0  Prof          B  56.0       49  Male  186960.0
1  Prof          A  12.0        6  Male   93000.0
2  Prof          A  23.0       20  Male  110515.0
3  Prof          A  40.0       31  Male  131205.0
4  Prof          B  20.0       18  Male  104800.0

In [37]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 78 entries, 0 to 77
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   rank        78 non-null     object
 1   discipline  78 non-null     object
 2   phd         76 non-null     float64
 3   service     78 non-null     int64
 4   sex         78 non-null     object
 5   salary      76 non-null     float64
dtypes: float64(2), int64(1), object(3)
memory usage: 3.8+ KB

In [39]:
pd.options.display.max_rows

60

In [41]:
df.isnull().sum()

rank          0
discipline    0
phd           2
service       0
sex           0
salary        2
dtype: int64

In [42]:
df.dropna(inplace=True)

In [43]:
df

         rank discipline   phd  service     sex    salary
0        Prof          B  56.0       49    Male  186960.0
1        Prof          A  12.0        6    Male   93000.0
2        Prof          A  23.0       20    Male  110515.0
3        Prof          A  40.0       31    Male  131205.0
4        Prof          B  20.0       18    Male  104800.0
..        ...        ...   ...      ...     ...       ...
73       Prof          B  18.0       10  Female  105450.0
74  AssocProf          B  19.0        6  Female  104542.0
75       Prof          B  17.0       17  Female  124312.0
76       Prof          A  28.0       14  Female  109954.0
77       Prof          A  23.0       15  Female  109646.0

[74 rows x 6 columns]

In [45]:
df.fillna("Error", inplace=True)
df

         rank discipline   phd  service     sex    salary
0        Prof          B  56.0       49    Male  186960.0
1        Prof          A  12.0        6    Male   93000.0
2        Prof          A  23.0       20    Male  110515.0
3        Prof          A  40.0       31    Male  131205.0
4        Prof          B  20.0       18    Male  104800.0
..        ...        ...   ...      ...     ...       ...
73       Prof          B  18.0       10  Female  105450.0
74  AssocProf          B  19.0        6  Female  104542.0
75       Prof          B  17.0       17  Female  124312.0
76       Prof          A  28.0       14  Female  109954.0
77       Prof          A  23.0       15  Female  109646.0

[74 rows x 6 columns]

In [46]:
df["salary"].fillna(45000, inplace=True)
df

         rank discipline   phd  service     sex    salary
0        Prof          B  56.0       49    Male  186960.0
1        Prof          A  12.0        6    Male   93000.0
2        Prof          A  23.0       20    Male  110515.0
3        Prof          A  40.0       31    Male  131205.0
4        Prof          B  20.0       18    Male  104800.0
..        ...        ...   ...      ...     ...       ...
73       Prof          B  18.0       10  Female  105450.0
74  AssocProf          B  19.0        6  Female  104542.0
75       Prof          B  17.0       17  Female  124312.0
76       Prof          A  28.0       14  Female  109954.0
77       Prof          A  23.0       15  Female  109646.0

[74 rows x 6 columns]

In [48]:
for x in df.index:
    if df.loc[x, "salary"] > 100000:
        df.loc[x, "salary"] = 100000
df

         rank discipline   phd  service     sex    salary
0        Prof          B  56.0       49    Male  100000.0
1        Prof          A  12.0        6    Male   93000.0
2        Prof          A  23.0       20    Male  100000.0
3        Prof          A  40.0       31    Male  100000.0
4        Prof          B  20.0       18    Male  100000.0
..        ...        ...   ...      ...     ...       ...
73       Prof          B  18.0       10  Female  100000.0
74  AssocProf          B  19.0        6  Female  100000.0
75       Prof          B  17.0       17  Female  100000.0
76       Prof          A  28.0       14  Female  100000.0
77       Prof          A  23.0       15  Female  100000.0

[74 rows x 6 columns]

In [55]:
df.duplicated()

0     False
1     False
2     False
3     False
4     False
      ...
73    False
74    False
75     True
76    False
77    False
Length: 74, dtype: bool

In [56]:
df.duplicated("salary").sum()

47

In [57]:
df.shape

(74, 6)

In [58]:
df.columns

Index(['rank', 'discipline', 'phd', 'service', 'sex', 'salary'], dtype='object')

In [59]:
df['salary']

0     100000.0
1      93000.0
2     100000.0
3     100000.0
4     100000.0
        ...
73    100000.0
74    100000.0
75    100000.0
76    100000.0
77    100000.0
Name: salary, Length: 74, dtype: float64

In [60]:
df.head(3)

   rank discipline   phd  service   sex    salary
0  Prof          B  56.0       49  Male  100000.0
1  Prof          A  12.0        6  Male   93000.0
2  Prof          A  23.0       20  Male  100000.0

In [61]:
df.tail(3)

    rank discipline   phd  service     sex    salary
75  Prof          B  17.0       17  Female  100000.0
76  Prof          A  28.0       14  Female  100000.0
77  Prof          A  23.0       15  Female  100000.0

In [62]:
df.sample(10)

        rank discipline   phd  service     sex    salary
66  AsstProf          A   7.0        6  Female   63100.0
35      Prof          B  28.0       23    Male  100000.0
36      Prof          B  45.0       45    Male  100000.0
22  AsstProf          A   4.0        2    Male   73000.0
29      Prof          B  21.0       20    Male  100000.0
25      Prof          B  35.0       31    Male   99418.0
23  AsstProf          A   2.0        0    Male   85000.0
37      Prof          A  20.0        8    Male  100000.0
8       Prof          A  29.0       19    Male   94350.0
52      Prof          A  12.0        0  Female  100000.0

In [63]:
df[['salary', 'phd', 'sex']]

      salary   phd     sex
0   100000.0  56.0    Male
1    93000.0  12.0    Male
2   100000.0  23.0    Male
3   100000.0  40.0    Male
4   100000.0  20.0    Male
..       ...   ...     ...
73  100000.0  18.0  Female
74  100000.0  19.0  Female
75  100000.0  17.0  Female
76  100000.0  28.0  Female
77  100000.0  23.0  Female

[74 rows x 3 columns]

In [64]:
df['salary'].mean()

92061.82432432432

In [65]:
df['rank'].unique()

array(['Prof', 'AssocProf', 'AsstProf'], dtype=object)

In [66]:
df['rank'].value_counts()

Prof         44
AsstProf     18
AssocProf    12
Name: rank, dtype: int64

In [72]:
salary2 = df['salary'] > 80000
df['salary2'] = salary2
df

         rank discipline   phd  service     sex    salary  salary2
0        Prof          B  56.0       49    Male  100000.0     True
1        Prof          A  12.0        6    Male   93000.0     True
2        Prof          A  23.0       20    Male  100000.0     True
3        Prof          A  40.0       31    Male  100000.0     True
4        Prof          B  20.0       18    Male  100000.0     True
..        ...        ...   ...      ...     ...       ...      ...
73       Prof          B  18.0       10  Female  100000.0     True
74  AssocProf          B  19.0        6  Female  100000.0     True
75       Prof          B  17.0       17  Female  100000.0     True
76       Prof          A  28.0       14  Female  100000.0     True
77       Prof          A  23.0       15  Female  100000.0     True

[74 rows x 7 columns]

In [77]:
x = (df['salary']<80000) & (df['sex'] == "Male")
df[x]

        rank discipline   phd  service   sex   salary  salary2
9       Prof          A  51.0       51  Male  57800.0    False
16  AsstProf          B   8.0        3  Male  75044.0    False
22  AsstProf          A   4.0        2  Male  73000.0    False

In [78]:
df.iloc[5:10, 0:3]

         rank discipline   phd
5        Prof          A  20.0
6   AssocProf          A  20.0
8        Prof          A  29.0
9        Prof          A  51.0
10       Prof          B  39.0

In [79]:
#Using titanic.csv file
df2 = pd.read_csv("training_titanic.csv")
df2

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [80]:
df2.head(10)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C

In [81]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 74 entries, 0 to 77
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   rank        74 non-null     object
 1   discipline  74 non-null     object
 2   phd         74 non-null     float64
 3   service     74 non-null     int64
 4   sex         74 non-null     object
 5   salary      74 non-null     float64
 6   salary2     74 non-null     bool
dtypes: bool(1), float64(2), int64(1), object(3)
memory usage: 6.2+ KB

In [82]:
df.describe()

             phd    service         salary
count  74.000000  74.000000      74.000000
mean   19.797297  15.040541   92061.824324
std    12.589384  12.161515   11690.178018
min     1.000000   0.000000   57800.000000
25%    10.250000   5.250000   85750.000000
50%    19.000000  14.500000  100000.000000
75%    27.750000  20.750000  100000.000000
max    56.000000  51.000000  100000.000000

In [83]:
df.shape

(74, 7)

In [84]:
df.duplicated().sum()

1

In [87]:
df.drop_duplicates()
df

         rank discipline   phd  service     sex    salary  salary2
0        Prof          B  56.0       49    Male  100000.0     True
1        Prof          A  12.0        6    Male   93000.0     True
2        Prof          A  23.0       20    Male  100000.0     True
3        Prof          A  40.0       31    Male  100000.0     True
4        Prof          B  20.0       18    Male  100000.0     True
..        ...        ...   ...      ...     ...       ...      ...
73       Prof          B  18.0       10  Female  100000.0     True
74  AssocProf          B  19.0        6  Female  100000.0     True
75       Prof          B  17.0       17  Female  100000.0     True
76       Prof          A  28.0       14  Female  100000.0     True
77       Prof          A  23.0       15  Female  100000.0     True

[74 rows x 7 columns]